ch4ron/Rocket-Software/Bolek/Bolek.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F4
ProjectManager.MainLocation=Src
Dma.SPI1_TX.1.Priority=DMA_PRIORITY_LOW
PB13.GPIOParameters=GPIO_Label
PA6.Mode=Full_Duplex_Master
USART2.IPParameters=VirtualMode
RCC.CortexFreq_Value=180000000
Dma.QUADSPI.2.Direction=DMA_PERIPH_TO_MEMORY
ProjectManager.KeepUserCode=true
PE11.GPIOParameters=GPIO_Label
Mcu.UserName=STM32F446VETx
QUADSPI.ClockPrescaler=3
SPI1.VirtualType=VM_MASTER
Dma.SPI1_TX.1.FIFOMode=DMA_FIFOMODE_DISABLE
PE11.GPIO_Label=LED_GREEN_2
RCC.PLLCLKFreq_Value=180000000
PB14.GPIO_Label=LED_RGB_BLUE_DO_NOT_USE
RCC.PLLQCLKFreq_Value=180000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_TIM14_Init-TIM14-false-HAL-true,5-MX_USART2_UART_Init-USART2-false-HAL-true,6-MX_SPI1_Init-SPI1-false-HAL-true,7-MX_QUADSPI_Init-QUADSPI-false-HAL-true
PD8.Locked=true
Dma.SPI1_TX.1.PeriphInc=DMA_PINC_DISABLE
PD6.Locked=true
PA6.GPIO_Label=MPU_MISO
RCC.PLLI2SRCLKFreq_Value=96000000
PB13.GPIO_Label=LED_RGB_HIGHONLY_DO_NOT_USE
PB13.Signal=GPIO_Output
RCC.SAIAFreq_Value=96000000
PinOutPanel.RotationAngle=90
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
Mcu.IP4=SPI1
RCC.FCLKCortexFreq_Value=180000000
Mcu.IP5=SYS
NVIC.SVCall_IRQn=true\:0\:0\:true\:false\:false\:false\:false
Mcu.IP2=QUADSPI
Mcu.IP3=RCC
Mcu.IP0=DMA
Mcu.IP1=NVIC
Mcu.UserConstants=
Dma.SPI1_RX.0.Direction=DMA_PERIPH_TO_MEMORY
Mcu.ThirdPartyNb=0
RCC.SDIOFreq_Value=180000000
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=180000000
PE2.Mode=Single Bank 1
Mcu.IPNb=8
ProjectManager.PreviousToolchain=SW4STM32
RCC.APB2TimFreq_Value=180000000
PB6.Signal=QUADSPI_BK1_NCS
RCC.SPDIFRXFreq_Value=180000000
PB6.Mode=Single Bank 1
PD8.GPIOParameters=GPIO_Label
SPI1.CalculateBaudRate=45.0 MBits/s
Mcu.Pin6=PC4
Mcu.Pin7=PB2
PD8.Signal=GPIO_Output
NVIC.DMA2_Stream0_IRQn=true\:5\:0\:true\:false\:true\:false\:true
Mcu.Pin8=PE8
PE10.Locked=true
Mcu.Pin9=PE9
RCC.VCOSAIOutputFreq_Value=192000000
QUADSPI.FlashSize=31
Dma.QUADSPI.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
RCC.AHBFreq_Value=180000000
PB13.Locked=true
Mcu.Pin0=PE2
Mcu.Pin1=PA1
PE14.Locked=true
PD5.Mode=Asynchronous
GPIO.groupedBy=
Mcu.Pin2=PA4
Mcu.Pin3=PA5
Mcu.Pin4=PA6
Mcu.Pin5=PA7
Dma.SPI1_TX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:true\:false\:true\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:true\:false\:true\:false\:false
NVIC.TIM8_TRG_COM_TIM14_IRQn=true\:0\:0\:true\:false\:true\:true\:true
PB2.Signal=QUADSPI_CLK
PA4.Locked=true
NVIC.SysTick_IRQn=true\:15\:0\:true\:false\:false\:false\:false
PB12.GPIO_Label=LED_RGB_GREEN_DO_NOT_USE
Dma.SPI1_RX.0.PeriphInc=DMA_PINC_DISABLE
ProjectManager.FirmwarePackage=STM32Cube FW_F4 V1.25.0
MxDb.Version=DB.5.0.60
PE15.Locked=true
PE13.Signal=GPIO_Output
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=2000000
PC4.GPIO_Label=MPU_INT
Dma.SPI1_TX.1.Mode=DMA_NORMAL
PE9.Signal=GPIO_Output
PE8.Locked=true
Dma.QUADSPI.2.FIFOMode=DMA_FIFOMODE_DISABLE
PE9.Locked=true
File.Version=6
PE2.Signal=QUADSPI_BK1_IO2
RCC.PLLRCLKFreq_Value=180000000
NVIC.PendSV_IRQn=true\:15\:0\:true\:false\:false\:false\:false
PE10.Signal=GPIO_Output
Dma.RequestsNb=3
ProjectManager.HalAssertFull=false
ProjectManager.ProjectName=Bolek
RCC.MCO2PinFreq_Value=180000000
Dma.SPI1_TX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
Mcu.Package=LQFP100
PA6.Signal=SPI1_MISO
NVIC.DMA2_Stream7_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PA7.Locked=true
PA5.Locked=true
NVIC.TimeBase=TIM8_UP_TIM13_IRQn
USART2.VirtualMode=VM_ASYNC
PE10.GPIOParameters=GPIO_Label
PD12.Signal=QUADSPI_BK1_IO1
ProjectManager.ToolChainLocation=
NVIC.TimeBaseIP=TIM13
PE12.GPIO_Label=LED_BLUE_2
PA5.GPIOParameters=GPIO_Label
PB14.GPIOParameters=GPIO_Label
Dma.QUADSPI.2.Instance=DMA2_Stream7
RCC.APB2CLKDivider=RCC_HCLK_DIV2
Dma.Request2=QUADSPI
Dma.QUADSPI.2.PeriphInc=DMA_PINC_DISABLE
RCC.CECFreq_Value=32786.88524590164
Dma.Request1=SPI1_TX
RCC.APB1TimFreq_Value=90000000
NVIC.BusFault_IRQn=true\:0\:0\:true\:false\:true\:false\:false
PC4.Locked=true
VP_TIM14_VS_ClockSourceINT.Mode=Enable_Timer
Dma.QUADSPI.2.Mode=DMA_NORMAL
PD6.Signal=USART2_RX
RCC.SAIBFreq_Value=96000000
PE10.GPIO_Label=LED_BLUE_1
Dma.Request0=SPI1_RX
Dma.SPI1_RX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode
PD5.Locked=true
PA4.GPIO_Label=MPU_CS
PE12.Locked=true
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
Dma.SPI1_TX.1.Instance=DMA2_Stream3
RCC.PLLSAIQCLKFreq_Value=96000000
PA5.Mode=Full_Duplex_Master
Dma.QUADSPI.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PA6.GPIOParameters=GPIO_Label
NVIC.EXTI4_IRQn=true\:5\:0\:true\:false\:true\:true\:true
Dma.SPI1_TX.1.MemInc=DMA_MINC_ENABLE
NVIC.QUADSPI_IRQn=true\:5\:0\:true\:false\:true\:true\:true
ProjectManager.ProjectFileName=Bolek.ioc
PE8.GPIOParameters=GPIO_Label
PA7.Mode=Full_Duplex_Master
PE14.GPIOParameters=GPIO_Label
Mcu.PinsNb=27
VP_TIM14_VS_ClockSourceINT.Signal=TIM14_VS_ClockSourceINT
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate
RCC.FMPI2C1Freq_Value=45000000
RCC.VCOI2SInputFreq_Value=1000000
Dma.QUADSPI.2.MemInc=DMA_MINC_ENABLE
PC4.Signal=GPXTI4
ProjectManager.DefaultFWLocation=true
PE14.GPIO_Label=LED_RGB_DO_NOT_WORK_DO_NOT_USE
PD5.Signal=USART2_TX
PB12.Locked=true
ProjectManager.DeletePrevious=true
Dma.SPI1_RX.0.Mode=DMA_NORMAL
PB14.Locked=true
RCC.APB1CLKDivider=RCC_HCLK_DIV4
Dma.SPI1_TX.1.Direction=DMA_MEMORY_TO_PERIPH
PD6.Mode=Asynchronous
NVIC.USART2_IRQn=true\:5\:0\:true\:false\:true\:true\:true
QUADSPI.IPParameters=ClockPrescaler,FlashSize
RCC.FamilyName=M
PE9.GPIOParameters=GPIO_Label
PE15.GPIOParameters=GPIO_Label
PD8.GPIO_Label=FLASH_RESET
Dma.SPI1_RX.0.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPI1_TX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
PE15.GPIO_Label=LED_RGB_HIGH_only_DO_NOT_USE
ProjectManager.TargetToolchain=SW4STM32
PE8.GPIO_Label=LED_GREEN_1
Dma.QUADSPI.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.QUADSPI.2.Priority=DMA_PRIORITY_LOW
RCC.USBFreq_Value=180000000
NVIC.DMA2_Stream3_IRQn=true\:5\:0\:true\:false\:true\:false\:true
PE11.Signal=GPIO_Output
PE9.GPIO_Label=LED_ORANGE
PA1.Signal=QUADSPI_BK1_IO3
RCC.VCOI2SOutputFreq_Value=192000000
PB14.Signal=GPIO_Output
PA5.Signal=SPI1_SCK
PE13.GPIOParameters=GPIO_Label
RCC.PLLSAIPCLKFreq_Value=96000000
board=custom
RCC.VCOOutputFreq_Value=360000000
ProjectManager.LastFirmware=true
NVIC.SPI1_IRQn=true\:5\:0\:true\:false\:true\:true\:true
VP_SYS_VS_tim13.Signal=SYS_VS_tim13
RCC.APB2Freq_Value=90000000
PA1.Mode=Single Bank 1
PE14.Signal=GPIO_Output
PE15.Signal=GPIO_Output
MxCube.Version=5.6.1
VP_SYS_VS_tim13.Mode=TIM13
PE8.Signal=GPIO_Output
RCC.PLLI2SPCLKFreq_Value=96000000
SPI1.Mode=SPI_MODE_MASTER
Dma.SPI1_RX.0.Instance=DMA2_Stream0
Dma.SPI1_RX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SPI1_RX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
ProjectManager.FreePins=false
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECFreq_Value,CortexFreq_Value,FCLKCortexFreq_Value,FMPI2C1Freq_Value,FamilyName,HCLKFreq_Value,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLM,PLLN,PLLQCLKFreq_Value,PLLRCLKFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PWRFreq_Value,SAIAFreq_Value,SAIBFreq_Value,SDIOFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USBFreq_Value,VCOI2SInputFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIInputFreq_Value,VCOSAIOutputFreq_Value
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F446V(C-E)Tx
RCC.PLLI2SQCLKFreq_Value=96000000
PE12.Signal=GPIO_Output
Mcu.Pin26=VP_TIM14_VS_ClockSourceINT
Dma.SPI1_RX.0.MemInc=DMA_MINC_ENABLE
Mcu.Pin24=PB6
ProjectManager.UnderRoot=true
PE13.Locked=true
Mcu.Pin25=VP_SYS_VS_tim13
Mcu.IP6=TIM14
RCC.VCOSAIInputFreq_Value=1000000
Mcu.IP7=USART2
ProjectManager.CoupleFile=true
PA4.Signal=GPIO_Output
RCC.SYSCLKFreq_VALUE=180000000
Mcu.Pin22=PD5
Mcu.Pin23=PD6
Mcu.Pin20=PD11
PA7.GPIO_Label=MPU_MOSI
Mcu.Pin21=PD12
PD12.Mode=Single Bank 1
PE13.GPIO_Label=LED_RGB_GREEN_LOWonly_DO)NOT_USE
SH.GPXTI4.0=GPIO_EXTI4
PA5.GPIO_Label=MPU_SCK
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PD11.Signal=QUADSPI_BK1_IO0
NVIC.MemoryManagement_IRQn=true\:0\:0\:true\:false\:true\:false\:false
PB2.Mode=Single Bank 1
ProjectManager.CompilerOptimize=6
ProjectManager.HeapSize=0x200
Mcu.Pin15=PE15
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB12
SH.GPXTI4.ConfNb=1
Mcu.Pin13=PE13
Mcu.Pin14=PE14
PD11.Mode=Single Bank 1
Mcu.Pin19=PD8
Dma.SPI1_RX.0.Priority=DMA_PRIORITY_LOW
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB13
Mcu.Pin18=PB14
NVIC.TIM8_UP_TIM13_IRQn=true\:0\:0\:false\:false\:true\:false\:true
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PE11
Mcu.Pin12=PE12
RCC.PLLM=8
RCC.PLLN=180
Mcu.Pin10=PE10
RCC.PWRFreq_Value=180000000
PE12.GPIOParameters=GPIO_Label
RCC.APB1Freq_Value=45000000
PA7.GPIOParameters=GPIO_Label
ProjectManager.DeviceId=STM32F446VETx
PB12.GPIOParameters=GPIO_Label
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
PA7.Signal=SPI1_MOSI
PA6.Locked=true
